{
  "main": {
    "name": "Damilola Faseun",
    "occupation": "Full-Stack Developer",
    "description": "A full-stack web developer based in Lagos Nigeria.",
    "image": "profilepic.jpg",
    "bio": "I am a creative front-end developer. I use JavaScript and React to create highly interactive and user friendly web experience.  After obtaining my degree in Electrical engineer, I took up a trainee position as an electrical engineer and worked briefly in the media industry, a friend of mine introduced me programming and recommended the online learning platform 'freecodecamp.com'. I found in programming a passion that encourages me to be innovative and allows me to express my creativity.  I have a keen intrest in web development and always try to think out of the box. I like learning new things and keeping up with industry trends and advancements.",
    "contactmessage": "I am currently available for work. Get in touch.",
    "email": "damilola.faseun@gmail.com",
    "phone": "+23407061935742",
    "address": {
      "street": "5 Alh. Adijat Lawal Cl, Mafoluku Oshodi",
      "city": "Lagos",
      "state": "Lagos",
      "zip": "100261"
    },
    "website": "https://www.linkedin.com/in/damilola-faseun-748602b1",
    "resumedownload": "https://drive.google.com/file/d/1PQEJIlOu0YRTnxGbysgx63BqQIx1bHwp/view?usp=sharing",
    "socials": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/damilola-faseun-748602b1",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/damigreen",
        "className": "fa fa-github"
      },
      {
        "name": "twitter",
        "url": "http://twitter.com/@damilolaFaseun",
        "className": "fa fa-twitter"
      },
      {
        "name": "instagram",
        "url": "https://instagram.com/dami_inc",
        "className": "fa fa-instagram"
      }
    ]
  },
  "resume": {
    "skillmessage1": "I excel in building clean and interactive user interfaces that work seamlessly across all devices with frameworks such as React and Vue. I also bring extensive experience in developing full-stack applications. ",
    "skillmessage2": "Additionally, I have hands-on expertise in deploying and managing applications using Google Cloud Platform, ensuring robust and scalable solutions.",
    "education": [
      {
        "school": "Obafemi Awolowo University, Ile-ife, Osun State",
        "degree": "B.Sc. Electronic and Electrical Engineering",
        "graduated": "December 2016",
        "description": ""
        
      }
    ],
    "work": [
      {
        "company": "VampFi",
        "title": "Full Stack Developer",
        "years": "2023 - 2024",
        "description": "I contributed as a Full Stack Developer, leveraging a diverse set of technologies to deliver high-quality web applications. On the frontend, I used Vue and React to create dynamic and responsive user interfaces, ensuring an engaging and seamless user experience. My work on the backend involved building robust and scalable server-side applications using Node.js and AdonisJS, enabling efficient data handling and secure communication between client and server. In addition, I played a key role in deploying and managing applications using Google Cloud Platform, optimizing the deployment pipeline and ensuring reliable performance and availability of our services."
      },
      {
        "company": "Filmo Real Estate Limited",
        "title": "Full Stack Developer",
        "years": "2021 - 2023",
        "description": "As a Full Stack Developer, I design, build, and test high-quality software solutions that are secure, scalable, and user-friendly. I ensure all deliverables meet industry standards and align with long-term technology goals. My approach is user-focused, emphasizing performance and seamless user experiences, while continuously exploring new technologies to drive digital transformation."
      },
      {
        "company": "The Creative Agency",
        "title": "Frontend Developer",
        "years": "2019 - 2021",
        "description": "I primarily focused on frontend development, utilizing React to build user-friendly and interactive web interfaces. I worked on creating responsive designs and ensuring a seamless user experience across different devices. Although my primary focus was on frontend, I also contributed to backend development using Node.js and Express, enabling efficient server-side functionality and integrating it smoothly with the frontend."
      }
    ],
    "skills": {
      "Web Technologies and Frameworks": ["HTML5|icons8-html-5", "CSS3|icons8-css3", "Reactjs|icons8-react", "Redux|icons8-redux", "JQuery|icons8-jquery", "REST API|icons8-rest-api-40-PNG", "GraphQL server|icons8-graphql"],
      "languages and Scripts": ["JavaScript|icons8-javascript", "NodeJS (Express)|icons8-nodejs", "Python|icons8-python"],
      "Database and ORM": ["MongoDB|icons8-mongodb", "Redux-ORM|redux-orm"],
      "Testing and Debugging": ["Jest|jest-seeklogo.com", "Cypress|cypress-PNG",  "Chrome developer tool|icons8-chrome", "Firefox developer tool|icons8-firefox"],
      "Others": ["Github|icons8-github", "NPM|icons8-npm", "Yarn|yarn-seeklogo.com", "Figma|figma-seeklogo.com"]
    }
  },
  "portfolio": {
    "projects": [
      {
        "title": "BlogKeep",
        "categories": "A Nodejs web Application that allows users save interesting blogs from the web with likes and comments features",
        "image":"blogkeep.png",
        "url": "https://polar-brushlands-57852.herokuapp.com/"
      },
      {
        "title": "Web Stickies",
        "categories": "A Simple  JavaScript application that allows you to quickly stick important note to your web browsers as a form of a remainder.",
        "image":"webstickies.png",
        "url": "https://damigreen.github.io/web-stickes/"
      },
      {
        "title": "PhoneBook",
        "categories": "A web application that utilizes the MERN stack and allows users easily manage their phonebook",
        "image":"phonebook.png",
        "url": "https://glacial-bayou-76915.herokuapp.com/"
      },
      {
        "title": "Battleship",
        "categories": "A JavaScript game allow a user play against battleships generated on grid locations and provides users with a trigger for targeting battleships locations on the grid",
        "image":"battleship.jpg",
        "url": "https://damigreen.github.io/battleship/"
      },
      {
        "title": "Country-Finder",
        "categories": "A React front-end portal that helps users acces information about a particular country including country flag, population, weather conditions etc .",
        "image":"countrystack.png",
        "url": "https://damigreen.github.io/country-stack/"
      },
      {
        "title": "Project-Minimek",
        "categories": "This is a miniature version of the MekHQ Battletech campaign force manager tool.",
        "image":"project-minimek.png",
        "url": "http://damigreen.github.io/project-minimek"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "",
        "user": ""
      }
    ]
  }
}